app/Controllers/Transaksi.php

SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '13'
INSERT INTO `transaksi` (`id_produk`, `stok_masuk`, `stok_keluar`, `tanggal`) VALUES ('13', 100, 50, '2025-10-18')
UPDATE `produk` SET `stok` = 192
WHERE `produk`.`id_produk` IN ('13')
---
    public function store()
    {
        $id_produk = $this->request->getPost('id_produk');
        $stok_masuk = (int) $this->request->getPost('stok_masuk');
        $stok_keluar = (int) $this->request->getPost('stok_keluar');

        // Ambil stok lama
        $produk = $this->produkModel->find($id_produk);
        $stok_lama = (int) $produk['stok'];

        // Hitung stok baru
        $stok_baru = $stok_lama + $stok_masuk - $stok_keluar;
        if ($stok_baru < 0) {
            return redirect()->back()->with('error', 'Stok tidak mencukupi untuk transaksi keluar!');
        }

        // Simpan transaksi
        $this->transaksiModel->insert([
            'id_produk' => $id_produk,
            'stok_masuk' => $stok_masuk,
            'stok_keluar' => $stok_keluar,
            'tanggal' => date('Y-m-d')
        ]);

        // Update stok produk
        $this->produkModel->update($id_produk, ['stok' => $stok_baru]);