app/Models/DashboardModel.php

SELECT `produk`.`nama_produk`, `produk`.`stok`, `kategori_produk`.`nama_kategori`
FROM `produk`
JOIN `kategori_produk` ON `kategori_produk`.`id_kategori` = `produk`.`id_kategori`
WHERE `kategori_produk`.`nama_kategori` = 'Premix'
ORDER BY `produk`.`nama_produk` ASC
---
    public function getStokByKategori($kategori)
    {
        return $this->select('produk.nama_produk, produk.stok, kategori_produk.nama_kategori')
                    ->join('kategori_produk', 'kategori_produk.id_kategori = produk.id_kategori')
                    ->where('kategori_produk.nama_kategori', $kategori)
                    ->orderBy('produk.nama_produk', 'ASC')
                    ->findAll();