app/Models/ProdukModel.php

SELECT `produk`.*, `kategori_produk`.`nama_kategori`
FROM `produk`
LEFT JOIN `kategori_produk` ON `kategori_produk`.`id_kategori` = `produk`.`id_kategori`
ORDER BY `produk`.`nama_produk` ASC
---
    public function getAllProduk()
    {
        return $this->select('produk.*, kategori_produk.nama_kategori')
                    ->join('kategori_produk', 'kategori_produk.id_kategori = produk.id_kategori', 'left')
                    ->orderBy('produk.nama_produk', 'ASC')
                    ->findAll();