app/Models/TransaksiModel.php

SELECT WEEK(tanggal, 1) AS minggu, SUM(stok_keluar) AS total_keluar
FROM `transaksi`
GROUP BY `minggu`
ORDER BY `minggu` ASC
 LIMIT 8
---
   public function getGrafikKeluarPerMinggu()
{
    return $this->select("WEEK(tanggal, 1) AS minggu, SUM(stok_keluar) AS total_keluar")
                ->groupBy("minggu")
                ->orderBy("minggu", "ASC")
                ->limit(8)
                ->findAll();