app/Models/TransaksiModel.php

SELECT `transaksi`.*, `produk`.`nama_produk`, `kategori_produk`.`nama_kategori`
FROM `transaksi`
LEFT JOIN `produk` ON `produk`.`id_produk` = `transaksi`.`id_produk`
LEFT JOIN `kategori_produk` ON `kategori_produk`.`id_kategori` = `produk`.`id_kategori`
ORDER BY `transaksi`.`tanggal` DESC
---
    public function getAllTransaksi()
    {
        return $this->select('transaksi.*, produk.nama_produk, kategori_produk.nama_kategori')
                    ->join('produk', 'produk.id_produk = transaksi.id_produk', 'left')
                    ->join('kategori_produk', 'kategori_produk.id_kategori = produk.id_kategori', 'left')
                    ->orderBy('transaksi.tanggal', 'DESC')
                    ->findAll();

SELECT AVG(stok_keluar) AS rata
FROM `transaksi`
WHERE `tanggal` >= '2025-10-12'
 LIMIT 1
SELECT `p`.`nama_produk`, SUM(t.stok_keluar) as total_keluar
FROM `transaksi` `t`
JOIN `produk` `p` ON `p`.`id_produk` = `t`.`id_produk`
JOIN `kategori_produk` `k` ON `k`.`id_kategori` = `p`.`id_kategori`
WHERE `k`.`nama_kategori` = 'Premix'
AND `t`.`tanggal` >= '2025-10-12'
GROUP BY `p`.`nama_produk`
ORDER BY `p`.`nama_produk` ASC
---
     public function getDataKeluar($kategori, $periode = 'week')
    {
        $builder = $this->db->table('transaksi t')
            ->select('p.nama_produk, SUM(t.stok_keluar) as total_keluar')
            ->join('produk p', 'p.id_produk = t.id_produk')
            ->join('kategori_produk k', 'k.id_kategori = p.id_kategori')
            ->where('k.nama_kategori', ucfirst($kategori));

        // Filter berdasarkan waktu
        if ($periode === 'month') {
            $builder->where('t.tanggal >=', date('Y-m-d', strtotime('-30 days')));
        } else {
            $builder->where('t.tanggal >=', date('Y-m-d', strtotime('-7 days')));
        }

        $builder->groupBy('p.nama_produk');
        $builder->orderBy('p.nama_produk', 'ASC');

        $result = $builder->get()->getResultArray();

SELECT AVG(stok_keluar) AS rata
FROM `transaksi`
WHERE `tanggal` >= '2025-10-12'
 LIMIT 1
---
public function getPrediksiKeluar()
{
    $result = $this->select("AVG(stok_keluar) AS rata")
                   ->where("tanggal >=", date('Y-m-d', strtotime('-7 days')))
                   ->first();

SELECT `p`.`nama_produk`, IFNULL(SUM(CASE WHEN DATE(t.tanggal) = CURDATE() THEN t.stok_masuk ELSE 0 END), 0) AS `in`, IFNULL(SUM(CASE WHEN DATE(t.tanggal) = CURDATE() THEN t.stok_keluar ELSE 0 END), 0) AS `out`, IFNULL(p.stok, 0) AS stok_akhir
FROM `produk` `p`
JOIN `kategori_produk` `k` ON `k`.`id_kategori` = `p`.`id_kategori`
LEFT JOIN `transaksi` `t` ON `t`.`id_produk` = `p`.`id_produk`
WHERE `k`.`nama_kategori` = 'Premix'
GROUP BY `p`.`id_produk`
ORDER BY `p`.`nama_produk` ASC
---
public function getStokHarianByKategori($kategori)
{
    return $this->db->table('produk p')
        ->select('p.nama_produk,
                  IFNULL(SUM(CASE WHEN DATE(t.tanggal) = CURDATE() THEN t.stok_masuk ELSE 0 END), 0) AS `in`,
                  IFNULL(SUM(CASE WHEN DATE(t.tanggal) = CURDATE() THEN t.stok_keluar ELSE 0 END), 0) AS `out`,
                  IFNULL(p.stok, 0) AS stok_akhir')
        ->join('kategori_produk k', 'k.id_kategori = p.id_kategori')
        ->join('transaksi t', 't.id_produk = p.id_produk', 'left')
        ->where('k.nama_kategori', $kategori)
        ->groupBy('p.id_produk')
        ->orderBy('p.nama_produk', 'ASC')
        ->get()
        ->getResultArray();

SELECT `k`.`nama_kategori`, `p`.`nama_produk`, ROUND(AVG(t.stok_keluar), 0) AS prediksi
FROM `transaksi` `t`
JOIN `produk` `p` ON `p`.`id_produk` = `t`.`id_produk`
JOIN `kategori_produk` `k` ON `k`.`id_kategori` = `p`.`id_kategori`
WHERE `t`.`tanggal` >= DATE_SUB(CURDATE(), INTERVAL 7 DAY)
GROUP BY `p`.`id_produk`
ORDER BY `k`.`nama_kategori` ASC
---
 public function getPrediksiMingguan()
    {
        return $this->db->table('transaksi t')
            ->select('k.nama_kategori, p.nama_produk, ROUND(AVG(t.stok_keluar), 0) AS prediksi')
            ->join('produk p', 'p.id_produk = t.id_produk')
            ->join('kategori_produk k', 'k.id_kategori = p.id_kategori')
            ->where('t.tanggal >= DATE_SUB(CURDATE(), INTERVAL 7 DAY)')
            ->groupBy('p.id_produk')
            ->orderBy('k.nama_kategori', 'ASC')
            ->get()
            ->getResultArray();

SELECT DATE(t.tanggal) as tanggal, SUM(t.stok_keluar) as total_keluar
FROM `transaksi` `t`
WHERE `t`.`tanggal` >= DATE_SUB(CURDATE(), INTERVAL 7 DAY)
GROUP BY DATE(t.tanggal)
ORDER BY `t`.`tanggal` ASC
---
    public function getWeeklyChartData()
{
    return $this->db->table('transaksi t')
        ->select('DATE(t.tanggal) as tanggal, SUM(t.stok_keluar) as total_keluar')
        ->where('t.tanggal >= DATE_SUB(CURDATE(), INTERVAL 7 DAY)')
        ->groupBy('DATE(t.tanggal)')
        ->orderBy('t.tanggal', 'ASC')
        ->get()
        ->getResultArray();